//	题目：两个乒乓球队进行比赛，各出三人，甲队为 a、b、c 三人，乙队为 x、y、z 三人。
//	     抽签决定比赛名单，有人向队员打听比赛的名单：a 说他不和 x 比，
//	     c 说他不和 x、z 比，请编写代码找出三队赛手的名单。
//	思路：
//	1.使用 3 个循环 分别枚举甲队的每个队员与乙队的队员匹配的可能性。
//	2.添加 约束条件，过滤掉不满足题目要求的组合：
//	            a 不和 x 比赛。
//	            c 不和 x 和 z 比赛。
//	3.确保每个乙队的队员只能和一个甲队的队员比赛。
#include<stdio.h>
int main()
{
	char group1[4]={'a','b','c'};
	char group2[4]={'x','y','z'};
	char i,j,k;//i是a的对手，j是b的对手，k是c的对手
	for(i='x'; i<='z'; i++)//a
	{
		for(j='x'; j<='z'; j++)//b
		{
			if(i!=j)//对手不能一样
				for(k='x'; k<='z'; k++)//c
				{
					if(k!=i&&k!=j)//对手不能一样
					{
						if(i!='x'&&k!='x'&&k!='z')//a 不和 x 比赛，c 不和 x 和 z 比赛。
						{
							printf("a Vs %c\nb Vs %c\nc Vs %c",i,j,k);
						}
					}
				}
		}
	}
}
