/*题目：企业发放的奖金根据利润提成。

利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%；
高于100万元时，超过100万元的部分按1%提成。
从键盘输入当月利润I，求应发放奖金总数？
程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成双精度浮点(double)型。*/
//#include<stdio.h>
//int main()
//{
//	double wage=0.0;
//	scanf("%lf",&wage);	
//	double temp=wage;
//	if(wage<=100000)
//	{
//		wage+=wage*0.100000;
//	}
//	else if(wage>100000&&wage<=200000)
//	{
//		wage+=100000*0.100000+(wage-100000)*0.075;
//	}
//	else if(wage>200000&&wage<=400000)
//	{
//		wage+=100000*0.100000+100000*0.075+(wage-20)*0.05;
//	}
//	else if(wage>400000&&wage<=600000)
//	{
//		wage+=100000*0.100000+100000*0.075+20*0.05+(wage-40)*0.03;
//	}
//	else if(wage>600000&&wage<=1000000)
//	{
//		wage+=100000*0.100000+100000*0.075+20*0.05+20*0.03+(wage-60)*0.015;
//	}
//	else
//	{
//		wage+=100000*0.100000+100000*0.075+20*0.05+20*0.03+40*0.015+(wage-1000000)*0.01;
//	}
//	printf("%f\n",wage);
//	printf("%f\n",wage-temp);
//	return 0;
//}





//优化版：
//#include<stdio.h>
//#define w 10000
//int main()
//{
//	double wage=0.0;
//	scanf("%lf",&wage);
//	wage/=w;
//	double temp=wage;
//	//将工资分为6个等级，分别算出该等级的最高利润，在算工资时加上
//	double rang[6]={0, 10*0.10, 10*0.10+10*0.075, 10*0.10+10*0.075+20*0.05, 10*0.10+10*0.075+20*0.05+20*0.03 ,10*0.10+10*0.075+20*0.05+20*0.03+40*0.015};
//	if(wage<=10)//0
//	{
//		wage+=rang[0]+wage*0.10;
//	}
//	else if(wage<=20)//1
//	{
//		wage+=rang[1]+(wage-10)*0.075;
//	}
//	else if(wage<=40)//2
//	{
//		wage+=rang[2]+(wage-20)*0.05;
//	}
//	else if(wage<=60)//3
//	{
//		wage+=rang[3]+(wage-40)*0.03;
//	}
//	else if(wage<=100)//4
//	{
//		wage+=rang[4]+(wage-60)*0.015;
//	}
//	else//5
//	{
//		wage+=rang[5]+(wage-100)*0.01;
//	}
//	printf("奖金为：%f\n",(wage-temp)*w);//奖金
//	printf("总工资为：%f\n",wage*w);//工资
//	
//	return 0;
//}
