//题目：古典问题（兔子生崽）：有一对兔子，从出生后第3个月起每个月都生一对兔子，
//小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数为多少？（输出前40个月即可）
//程序分析：兔子的规律为数列1,1,2,3,5,8,13,21....，即下个月是上两个月之和（从第三个月开始）。
//          月    大 中 小   总
//          1     1          1
//          2     1		     1                                   
//          3     1     1    2
//          4     1  1  1    3
//          5     2  1  2    5
//          6     3  2  3    8
//          7     5  3  5    13
//          8     8  5  8    21
//#include <stdio.h>
//int main()
//{
//	int a = 1, b = 1, temp;
//	printf("%12d\n%12d\n", a, a); // 输出前两月的数量
//	for (int i = 3; i <= 40; i++)//i表示月数
//	{
//		temp = a + b; //a表示大兔子，b表示中兔子和小兔子，temp表示兔子总数
//		printf("%12d\n", temp); // 输出下一项
//		
//		a = b; //上一轮b的数量等于下一轮a的数量
//		b = temp; //上一轮兔子总数等于下一轮b的数量
//	}
//	return 0;
//}





//#include<stdio.h>
//int main()
//{
//	int n[41];    //定义
//	n[0] = 0;    //赋值
//	n[1] = 1;
//	n[2] = 1;
//	for (int i = 3; i < 41; i++)//下一个月兔子总数等于上两个月兔子总数之和
//	{
//		n[i] = n[i - 1] + n[i - 2];
//	}
//	printf("month\tnumber\n");// 遍历输出
//	for (int i = 1; i < 41; i++)
//	{
//		printf("%d\t%d\n", i, n[i]);
//	}
//}





#include<stdio.h>

int main()
{
	int yt=1,et=0,st=0,zt;   // 一兔 二兔 三兔 总兔 \(=_=)/
	for(int t=0;t<40;t++)
	{ 
		st = et+st;              // 0  0  1  1
		et = (t == 0) ? 0 : yt;       // 0  1  0  1
		yt = (t == 0) ? 1 : st;       // 1  0  1  1
		zt = yt+et+st;           // 1  1  2  3......
		printf("%2d月%-10d对\n",t+1,zt);
	}
}
